# ExternallyTaggedGeometryObject Properties

---
The ExternallyTaggedGeometryObject type exposes the following members.
| Name| Description
---|---|---
| ExternalId|  The external Id of the geometry object.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace